import prettytable as pt

tb = pt.PrettyTable()
print("                                  商城")
tb.field_names = ["日  期", "服装名称", "单价", "库存数量", "销售量/每日", "每日总金额", "销售额占比", "销量占比"]
tb.add_row(["1号", "羽绒服", 235.6, 500, 10, 2536, "0.1%", "0.003%"])
tb.add_row(["2号", "牛仔裤", 86.3, 600, 60, 5178, "0.01%", "0.01%"])
tb.add_row(["3号", "风衣", 96.8, 335, 43, 4162.4, "0.02%", "0.01%"])
tb.add_row(["4号", "皮草", 135.9, 855, 63, 8516.7, "0.01%", "0.007%"])
tb.add_row(["5号", "T恤", 65.8, 632, 63, 4145.4, "0.01%", "0.01%"])
tb.add_row(["6号", "衬衫", 49.3, 562, 120, 5916, "0.008%", "0.02%"])
tb.add_row(["7号", "牛仔裤", 86.3, 600, 72, 6213.6, "0.01%", "0.01%"])
tb.align = "c"
print(tb)
sum = 2536 + 5178 + 4162.4 + 8516.7 + 4145.4 + 5916 + 6213.6
print("销售总额：" + sum.__str__())
